1- Cargar datos, EDA, limpieza
2- ERD (diagama entidad-relacion)
3- Cargar datos (insert) (tiene orden)
4- Queries (5-6)

# CARGAMOS DATOS

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

actor = pd.read_csv('Data/actor.csv', encoding="latin1")
category = pd.read_csv('Data/category.csv', encoding="latin1")
film = pd.read_csv('Data/film.csv', encoding="latin1")
inventory = pd.read_csv('Data/inventory.csv', encoding="latin1")
language = pd.read_csv('Data/language.csv', encoding="latin1")
old_HDD = pd.read_csv('Data/old_HDD.csv', encoding="latin1")
rental = pd.read_csv('Data/rental.csv', encoding="latin1")

In [2]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

### ACTOR

In [3]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [4]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [5]:
actor.drop('last_update', axis=1, inplace=True)

### CATEGORY

In [6]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [7]:
category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

In [8]:
category.drop('last_update', axis=1, inplace=True)

In [9]:
len(category.category_id.unique())

16

In [10]:
len(category.name.unique())

16

## FILM

In [11]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [12]:
film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

In [13]:
film.drop('last_update', axis=1, inplace=True)

In [14]:
film.language_id.value_counts()

1    1000
Name: language_id, dtype: int64

In [15]:
len(film.film_id.value_counts())

1000

Todas las peliculas estan en un unico idioma

In [16]:
'''
from datetime import datetime

def set_original_languages():
    print("INTRODUCE EL IDIOMA ORIGINAL")
    print("----------------------------")
    print(language[['name', 'language_id']])
    print("----------------------------")
    print("---PULSA 0 PARA TERMINAR----")
    print("----------------------------")
    for i in film.original_language_id.isnull().index:
        print(film.title[i])
        new = int(input("\tid del idioma:"))
        if new == 0 or new>len(language.name):
            #FALTARIA ACTUALIZAR EL LAST UPDATE
            #film.last_update[i]=datatime.now()
            film2 = film.to_csv('Data/film.csv')
            print("----------------------------")
            print("-----PROCESO FINALIZADO-----")
            return
        film.original_language_id[i]=new
set_original_languages()
'''

'\nfrom datetime import datetime\n\ndef set_original_languages():\n    print("INTRODUCE EL IDIOMA ORIGINAL")\n    print("----------------------------")\n    print(language[[\'name\', \'language_id\']])\n    print("----------------------------")\n    print("---PULSA 0 PARA TERMINAR----")\n    print("----------------------------")\n    for i in film.original_language_id.isnull().index:\n        print(film.title[i])\n        new = int(input("\tid del idioma:"))\n        if new == 0 or new>len(language.name):\n            #FALTARIA ACTUALIZAR EL LAST UPDATE\n            #film.last_update[i]=datatime.now()\n            film2 = film.to_csv(\'Data/film.csv\')\n            print("----------------------------")\n            print("-----PROCESO FINALIZADO-----")\n            return\n        film.original_language_id[i]=new\nset_original_languages()\n'

## INVENTORY

In [17]:
inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [18]:
inventory.shape

(1000, 4)

In [19]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [20]:
inventory.drop('last_update', axis=1, inplace=True)

## LANGUAGE

In [21]:
language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [22]:
language.shape

(6, 3)

In [23]:
language.drop('last_update', axis=1, inplace=True)

## old_HDD

In [24]:
old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [25]:
len(old_HDD.title.unique())

614

Hay 386 peliculas en las cuales no podemos determinar su category_id.
la columna category_id, me parece interesante que este en la tabla de films
por lo que voy a desplazarla

In [26]:
old_HDD.head(1)

  first_name last_name             title  release_year  category_id
0   PENELOPE   GUINESS  ACADEMY DINOSAUR          2006            6

In [27]:
film.insert(4,'category_id', [film.title[i] for i in range(len(film))])

In [28]:
film.head(1)

,film_id,title,description,release_year,category_id,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,ACADEMY DINOSAUR,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"

In [29]:
dic = {}
for i in range(len(old_HDD)):
    dic[old_HDD.iloc[i].title]=old_HDD.iloc[i].category_id   

def hola(x):
    try: return dic[x]
    except: return 0
    
film.category_id = film.category_id.apply(hola).astype(dtype='int64')

Las columnas 'category_id' y 'release_year' no son necesarias ya que podemos
acudir a esos datos mediante la concatenacion de tablas en sql

De la  misma manera, solo necesitamos relacionar el autor con la pelicula que ha hecho,
por lo que podemos cambiar el nombre y apellido por su id directamente y el titulo de la pelicula por el id de la pelicula.

In [30]:
old_HDD['complete_name']=old_HDD.first_name+' '+old_HDD.last_name
actor['complete_name']=actor.first_name+' '+actor.last_name

In [31]:
old_HDD = actor.merge(old_HDD, on='complete_name').merge(film, on='title', how='left')[['actor_id', 'film_id']]

In [52]:
old_HDD.head(10)

   actor_id  film_id
0         1        1
1         1       23
2         1       25
3         1      106
4         1      140
5         1      166
6         1      277
7         1      361
8         1      438
9         1      499

In [33]:
actor.drop('complete_name', axis=1, inplace=True)

## RENTAL

In [34]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [35]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [36]:
rental.shape

(1000, 7)

In [37]:
rental.drop('last_update', axis=1, inplace=True)

## EXPORTAMOS DATOS

actor.to_csv('Data/actor.csv', index=False)
category.to_csv('Data/category.csv', index=False)
film.to_csv('Data/film.csv', index=False)
inventory.to_csv('Data/inventory.csv', index=False)
language.to_csv('Data/language.csv', index=False)
old_HDD.to_csv('Data/old_HDD.csv', index=False)
rental.to_csv('Data/rental.csv', index=False)

# CONECTAMOS CON SQL

In [39]:
from sqlalchemy import create_engine

In [40]:
with open('data/password.txt', 'r') as file:
    pass_=file.readlines()[0]
str_conn=f'mysql+pymysql://root:{pass_}@localhost:3306'
cursor=create_engine(str_conn)
cursor.execute('drop database if exists IronCineClub;')
cursor.execute('create database IronCineClub;')

In [41]:
str_conn=f'mysql+pymysql://root:{pass_}@localhost:3306/IronCineClub'
cursor=create_engine(str_conn)

In [42]:
actor.to_sql(name='actor', con=cursor, if_exists='replace', index=False)
category.to_sql(name='category', con=cursor, if_exists='replace', index=False)
film.to_sql(name='film', con=cursor, if_exists='replace', index=False)
inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)
language.to_sql(name='language', con=cursor, if_exists='replace', index=False)
old_HDD.to_sql(name='old_HDD', con=cursor, if_exists='replace', index=False)
rental.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

1000

## Creamos tablas para el staff, curstomers y store

In [43]:
import mysql.connector as conn
# conectar a base de datos 
db = conn.connect(host='localhost', user='root', passwd=pass_, database='IronCineClub')
cursor=db.cursor()

In [44]:
query='''
         CREATE TABLE staff(
                staff_id BIGINT PRIMARY KEY not null,
                store_id BIGINT,
                first_name TEXT,
                last_name TEXT
            );
'''
cursor.execute(query)

In [45]:
query='''
         CREATE TABLE customer(
                customer_id BIGINT PRIMARY KEY not null,
                first_name TEXT,
                last_name TEXT
            );
'''
cursor.execute(query)

In [46]:
query='''
         CREATE TABLE store(
                store_id BIGINT PRIMARY KEY not null,
                longitude DOUBLE,
                latitude DOUBLE
            );
'''
cursor.execute(query)

DEFINIMOS CONEXIONES CON PRIMARY KEYS Y FOREIGN KEYS

In [47]:
cursor.execute('ALTER TABLE actor ADD PRIMARY KEY (actor_id);')
cursor.execute('ALTER TABLE category ADD PRIMARY KEY (category_id);')
cursor.execute('ALTER TABLE film ADD PRIMARY KEY (film_id);')
cursor.execute('ALTER TABLE inventory ADD PRIMARY KEY (inventory_id);')
cursor.execute('ALTER TABLE language ADD PRIMARY KEY (language_id);')
cursor.execute('ALTER TABLE rental ADD PRIMARY KEY (rental_id);')

In [48]:
cursor.execute('ALTER TABLE old_HDD ADD FOREIGN KEY (actor_id) REFERENCES actor(actor_id);')
cursor.execute('ALTER TABLE old_HDD ADD FOREIGN KEY (film_id) REFERENCES film(film_id);')
cursor.execute('ALTER TABLE film ADD FOREIGN KEY (language_id) REFERENCES language(language_id);')
cursor.execute('ALTER TABLE inventory ADD FOREIGN KEY (film_id) REFERENCES film(film_id);')
cursor.execute('ALTER TABLE staff ADD FOREIGN KEY (store_id) REFERENCES store(store_id);')

staff = pd.DataFrame(columns=['staff_id', 'store_id', 'first_name', 'last_name'])
customer = pd.DataFrame(columns=['customer_id', 'first_name', 'last_name'])
store = pd.DataFrame(columns=['store_id', 'longitude', 'latitude'])

staff['staff_id'] = [i for i in range(1,len(list(inventory.store_id.unique()))+1)]
staff['store_id'] = [2,1]
staff['first_name'] = ['Kike', 'Yonatan']
staff['last_name'] = ['Revuelts', 'Rodriguez']
staff.head()

nombre_tabla='staff'
columnas=','.join(staff.columns)
for i in range(len(staff)):   # bucle por filas
    valores=tuple(staff.iloc[i].values)
    insert_query=f'insert into {nombre_tabla} ({columnas}) values {valores};'
    cursor.execute(insert_query)
#db.commit()

In [49]:
len(list(rental.customer_id.unique()))

485

Solo tenemos dos tiendas con un unico trabajador y 1000 clientes

### Estas querys no me deja lanzarlas desde Pyhton directamente sin desactivar el FOREIGN KEY CHECK perviamente

ERROR CODE: 1452 a foreign key constraint fails

In [50]:
cursor.execute("SET FOREIGN_KEY_CHECKS=0;")

In [51]:
cursor.execute('ALTER TABLE film ADD FOREIGN KEY (category_id) REFERENCES category(`category_id`);')
cursor.execute('ALTER TABLE rental ADD FOREIGN KEY (staff_id) REFERENCES staff(staff_id);')
cursor.execute('ALTER TABLE rental ADD FOREIGN KEY (customer_id) REFERENCES customer(customer_id);')
cursor.execute('ALTER TABLE inventory ADD FOREIGN KEY (store_id) REFERENCES store(store_id);')
cursor.execute('ALTER TABLE rental ADD FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id);')